Revit 2024 API
RebarGeometryType Enumeration
 Rebar geometry type
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum RebarGeometryType
Visual Basic
Public Enumeration RebarGeometryType
Visual C++
public enum class RebarGeometryType
Members
Member name | Description
ShapeBased |  Shape Driven.
FreeForm |  Free Form.
See Also
Autodesk.Revit.DB.Structure Namespace